<html>
	<head>
	</head>
		<body>
			<?php
				/*
					形式1<?php
						
						?>
					形式2<script language = "php">
					
						 </script>
					形式3<?
						
						?>
					php的结束标记在如下情况可以省略
						php的语句之后，再没有了html代码部分
					php区分大小写特性
						1.变量区分大小写
						2.常量通常默认也区分，但可以人为设定不区分
						3.其他场合的关键字都不区分，比如函数名，系统关键字(for,if return......)
					php注释
						单行注释
							形式1：//注释内容
							形式2：#注释内容
						多行注释
						2个多行注释的技巧
							有时候，我们因为测试或别的原因，需要将一大段代码进行多次注释，或反注释
							则此时可以使用如下2个技巧
				//*/
			?>
		</body>
</html>